[
  {
    "id": "6675eb58-ca9f-4850-82cc-372ff5dd3f2d",
    "type": "Full time",
    "company": "Google",
    "title": "Software Developer",
    "description": "<p>Chapman and Cutler LLP seeks a Software Engineer to join our Practice Innovations team.  The Software Engineer will work on the Chapman Practice Innovations (CPI) team to deliver cutting-edge technology solutions to develop new applications (and improve existing ones) that help automate legal tasks, provide business intelligence and enhance business workflow.  As part of the CPI team, the Software Engineer will work with attorneys, clients and internal Firm departments to develop solutions promoting attorney productivity, transaction efficiency and client service.  This position will report to the Chief Innovation Officer.</p>\n<p>​The day-to-day responsibilities of the Software Engineer will include:</p>\n<ul>\n<li>Full-stack application development\n​- Works with requirements and stakeholders to design and prototype web-based tools and platforms</li>\n<li>Designs, develops and manages well-tested code</li>\n<li>Improves overall code quality across all our applications, and suggests, promotes and documents architectural and environment recommendations</li>\n<li>Extends and integrates internal and third-party systems with web services and API connections</li>\n<li>Works with analysts, attorneys and clients to understand and respond to internal and external stakeholder needs</li>\n<li>Troubleshoots issues and resolves as appropriate – i.e., software bugs, user errors, etc.</li>\n<li>Continuously looks for ways to improve our solutions from the end user experience</li>\n</ul>\n<p>MINIMUM QUALIFICATIONS:</p>\n<ul>\n<li>Bachelor’s degree\n​- Experience: 2-4 years of experience with full-stack development, including proficiency with the following:\n​     - HTML, CSS, SASS, Bootstrap\n​​     - JavaScript, particularly experience with Node, React and/or Vue\n​     - SQL and NoSQL databases\n​     - XML, JSON, YAML, and other data exchange formats\n​     - RESTful APIs\n​     - ​Exposure to or experience with Python\n​     - Exposure to or experience with machine learning and natural language processing</li>\n<li>Self-starter, willing to learn new languages, frameworks and overall technologies</li>\n<li>​Pragmatic approach to working within confines of various enterprise systems and finding cross-system solutions</li>\n<li>Knowledge of cross-browser compatibility and how different browsers interact with our systems</li>\n<li>Appreciation of conceptual and intellectual challenges, exploring advances in technology to solve problems</li>\n<li>Good sense of UI/UX, aiming for an optimal end-user experience</li>\n<li>Familiarity with evaluation, selection and implementation of third-party software</li>\n<li>Ability to receive and administer constructive feedback and apply lessons learned to future projects</li>\n</ul>\n<p>Applicants should submit a resume as well as a cover letter outlining your interest in the position and why it is a good fit for you.  All applicants will be considered; however, the hiring decision will be made based on qualifications for the position.</p>\n<p>Chapman and Cutler LLP is an Equal Opportunity Employer M/F/D/V/SO.</p>\n<p>​</p>\n",
    "link": "https://example.com/",
    "tags": ["Firebase", "Javascript", "HTML", "Github", "Python", "Golang", "Bash"]
  },
  {
    "id": "64c4da30-33d0-4056-bf83-bac661a99209",
    "type": "Full time",
    "company": "Tulip Retail",
    "title": "Frontend Developer",
    "description": "<p>Harvard University</p>\n<p>Applications Developer\nHarvard Law School\n53617BR</p>\n<p>Job Summary</p>\n<p>Independently perform complex applications/web development for projects of large to very large size and complexity; typically work as part of a team to implement business solutions. Responsible for all aspects of application development cycle. Code advanced and complex software solutions.</p>\n<p>Job Code\nI0757P Applications Professional III</p>\n<p>Job-Specific Responsibilities</p>\n<p>The Applications Developer is a member of the ITS Business Solutions team, contributing to the full development lifecycle of applications targeting areas such as Admissions, Student Services, Executive Education and the academic program. The successful candidate will thrive in a nimble, Agile development environment, enjoy working directly with our business partners, and be comfortable moving between technologies based on business requirements and emerging trends. Projects range from React and Node, to C#/.Net, hosted both in on-premises and SaaS environments.</p>\n<p>As an Applications Developer you will:</p>\n<ul>\n<li>\n</ul>\n<p>Work in partnership with clients to implement and maintain practical, innovative, integrated, and reliable solutions\n*\nParticipate on project teams, utilizing Agile, rapid development processes\n*\nLead Agile Scrum ceremonies, such as backlog grooming, sprint planning, daily stand-ups, and retrospectives\n*\nBuild integrations between systems\n*\nEngage with vendors on new feature implementations, and to resolve product issues\n*\nTriage bugs with clients, to ensure accurate detail and prioritization</p>\n<p>Typical Core Duties</p>\n<ul>\n<li>Participate fully in software development life cycle</li>\n<li>Implement and support technical solutions to deliver business requirements</li>\n<li>Identify and evaluate opportunities to improve services</li>\n<li>Contribute ideas to coding best practices and new technologies</li>\n<li>Draw on relationship and technical skills to act as technical liaison to internal and external clients</li>\n<li>Abide by and follow the Harvard University IT technical standards, policies and Code of Conduct</li>\n</ul>\n<p>Basic Qualifications</p>\n<ul>\n<li>Minimum of two years' post-secondary education or relevant work experience</li>\n</ul>\n<p>Additional Qualifications and Skills</p>\n<ul>\n<li>\n</ul>\n<p>Solid understanding of a variety of programming constructs, software design patterns, and their uses in common tasks\n*\nComfort working in a variety of operating systems, technical architectures and programming languages\n*\nExperience working on teams utilizing Agile development methodologies\n*\nSolid organizational skills, including time management and prioritization\n*\nSelf-starter with ability to work with diverse technical and non-technical clients\n*\nStrong team player with a positive attitude, and committed to the success of the overall team\n*\nAbility to accept constructive feedback, and act on it\n*\nDemonstrated team performance skills, service mindset approach, and the ability to act as a trusted advisor</p>\n<p>Additional Information</p>\n<p>Be a part of excellence and leadership in legal education and scholarship at Harvard Law School. We are a community of talented people from diverse backgrounds, lived experiences, and perspectives, dedicated to advancing the cause of justice all over the world. We value our differences and our diversity as a source of strength. We are committed to developing and inspiring our students and our workforce. Whoever you are, whatever you do, however you do it, Harvard Law School is a place where you can thrive.</p>\n<p>All offers to be made by HLS Human Resources.</p>\n<p>Job Function\nInformation Technology</p>\n<h2>Sub Unit</h2>\n<p>Location\nUSA - MA - Cambridge</p>\n<p>Department\nITS Business Solutions</p>\n<p>Time Status\nFull-time</p>\n<p>Union\n00 - Non Union, Exempt or Temporary</p>\n<p>Salary Grade\n057</p>\n<p>Pre-Employment Screening\nCriminal, Identity</p>\n<p>Schedule\n35h; Monday through Friday - 9am to 5pm</p>\n<p>EEO Statement\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, gender identity, sexual orientation, pregnancy and pregnancy-related conditions, or any other characteristic protected by law.</p>\n<p>Apply Here: <a href=\"https://www.click2apply.net/6eqgb1tWBzBPu1NVHrGXy\">https://www.click2apply.net/6eqgb1tWBzBPu1NVHrGXy</a></p>\n<p>PI132178968</p>\n",
    "link": "https://example.com/",
    "tags": ["jQuery", "Javascript", "HTML", "CSS", "Github"]
  },
  {
    "id": "545a11b9-6fe6-4b8a-a3d1-e75be2ea23ad",
    "type": "Part time",
    "company": "NCR",
    "title": "Software Developer",
    "description": "<p>Do you want to work on the next generation consultation platform involving <strong>chatbots, recommender systems, and machine learning</strong>? Chatchamp is revolutionizing online shopping with our automatized on-site consultation platform. We are a young and fast-moving startup with flat hierarchies and a focus on learning as we are working with brand new technologies.</p>\n<p><strong>Tasks</strong></p>\n<p><em>Take responsibility for the whole stack:</em></p>\n<ul>\n<li>Design, develop, test, deploy, maintain and improve scalable software</li>\n<li>Work closely together with our CTO and take part in architectural decision making</li>\n</ul>\n<p><em>Our tech:</em></p>\n<ul>\n<li>Microservice architecture running on Node.js (ES6)</li>\n<li>React, Vue.js, and Ruby on Rails in the Frontend</li>\n<li>PostgreSQL, Redis, Kubernetes, AWS, and Python for ML</li>\n<li>CI, CD, Code Reviews, Automated Testing, Clean Code</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>5+ years of development experience in at least one scripting language (JS)</li>\n<li>You work independently, are highly motivated, a fast learner, and a problem solver</li>\n<li>English (full professional proficiency)</li>\n<li>You get things done and have an appreciation for eye-catching UI/UX</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Office at Marienplatz (city center) and regular home office 🏡</li>\n<li>Flexible working hours, work-life balance ⚖️, and competitive salary</li>\n<li>Book flat rate 📚, gym membership 🏋️‍♂️ , and monthly learning events</li>\n<li>And of course team events, fruits, snacks, and Bavarian beer 🍻 (after work)</li>\n</ul>\n<p>We look forward to your short and concise application. We're also looking for remote developers with a maximum time difference of 2 hours to UTC+1.</p>\n",
    "link": "https://example.com/",
    "tags": ["Java", "Github", "HTML", "Unit Testing", "Git"]
  },
  {
    "id": "454860a1-87bc-4644-9d30-db13e41ff339",
    "type": "Internship",
    "company": "The Cooperators",
    "title": "Fullstack Developer",
    "description": "<p>Description:\nAs a PHP Full-stack Web Developer, your focus would be on building out interfaces, interactions, and functionality for custom websites and web apps. While the framework or CMS may change from project to project, one constant is our commitment to quality. We primarily build and maintain sites built on WordPress and Laravel, but we value every developer’s input on the best tools for the job. We understand that there is no one-size-fits-all solution, so figuring out the best tools for the job is something we take seriously.</p>\n<p>Essential Job Functions:\nUse modern technologies and tools to build frontend and backend web experiences, including e-commerce and application development.\nCollaborate with other developers on various projects.\nWork with designers and content strategists to determine style, interaction, and functional requirements for upcoming projects.\nTroubleshoot bugs and other issues on live sites.\nManage multiple projects at any one time.</p>\n<p>What We Use:\nPHP\nHTML/CSS\nJS / jQuery / Vue\nGrunt / Gulp / Webpack\nNode / NPM / Bower\nWordPress / Laravel</p>\n<p>Qualifications:\n3+ years of coding experience\nA strong working knowledge of frontend languages such as HTML, JavaScript, PHP and MySQL.\nExperience working with front-end JavaScript libraries (jQuery, Vue, etc) and style frameworks (Bootstrap, Bulma, etc).\nExperience working with PHP-based CMSes (WordPress, Drupal, etc) and Frameworks (Laravel, Symfony, etc).\nA keen eye for user interaction and flow.\nA good sense of code structure and modern development methodologies.\nCares about the code they write.\nCan communicate effectively about development topics with non-technical roles.\nHigh attention to detail.\nAnd of course, someone who is willing to learn and grow in development and explore new ideas.</p>\n",
    "link": "https://example.com/",
    "tags": ["CSS", "Javascript", "Github", "HTML", "Git", "Kafka", "Python"]
  },
  {
    "id": "7182ff94-578b-4be1-865d-8f6a0c75275a",
    "type": "Full time",
    "company": "Mozilla",
    "title": "Quality Assurance",
    "description": "<p>Kinsta is a modern cloud hosting company focused on WordPress hosting. We run our services on cutting-edge technology and we are proud of the level of support we offer to our customers. Our talented and motivated team is scattered across the globe with team members hailing from every continent but Antarctica! We're constantly on the lookout for great talent to join our awesome team. If you’d like to become part of the Kinsta family, just hit apply!</p>\n<p>We are looking for a motivated and professional DevOps Engineer to help us maintain the best-performing hosting architecture on the market.</p>\n<p><strong>You will be instrumental in making sure our architecture is always on the bleeding edge of technology remaining stable and high performing at all times. This involves:</strong></p>\n<ul>\n<li>Optimizing server provisioning</li>\n<li>Fine-tuning our servers on a system level and on application level</li>\n<li>Ensuring high scalability as the number of created VMs increases on our network</li>\n<li>Overseeing and ensuring smooth running and completion of server-wide updates</li>\n<li>Ensuring optimal software communication between our server architecture and our hosting platform (MyKinsta)</li>\n<li>Acting as an escalation point for our SysOps team if a bug or issue proves to be particularly difficult</li>\n<li>Creating tools to prevent or mitigate instances of high load, ensure security and stability throughout the system</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>At least 5 years of experience working with Ubuntu/Debian</li>\n<li>3 years of experience with PHP</li>\n<li>Experience with a PHP framework</li>\n<li>Deep knowledge of LXC</li>\n<li>Strong experience writing Ansible scripts</li>\n<li>Experience with Nginx</li>\n<li>Previous experience in the hosting industry</li>\n<li>Excellent general understanding of Linux, cloud networking and server management</li>\n<li>Technical awareness and ability to quickly understand new technologies</li>\n</ul>\n<p><strong>Bonus skills</strong></p>\n<ul>\n<li>Experience with the standard WordPress stack (PHP, MySQL, WordPress)</li>\n<li>Experience working with ZFS</li>\n<li>Experience working with ELK stack</li>\n<li>Experience with Node.js apps</li>\n<li>Database query optimization</li>\n<li>Having worked in JIRA</li>\n<li>Good understanding of APIs and web service</li>\n<li>Deep knowledge of Google Cloud based server architecture</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Fully remote culture with a globally distributed, international team</li>\n<li>We offer a flexible and relaxed working environment where everyone can work in peace</li>\n<li>In order to ensure that everyone has time to rest and recharge, we offer Flexible paid time off</li>\n<li>We do not have any investors and we do not work directly with clients. This means we rarely have any deadlines and have the luxury of thinking features through and implementing them correctly instead of quickly</li>\n<li>Everyone has a voice in the development process</li>\n<li>We work with only the newest and best technology</li>\n</ul>\n",
    "link": "https://example.com/",
    "tags": ["Github", "Javascript"]
  }
]
